package model;

import lombok.Getter;

import java.util.Arrays;
import java.util.Collections;
import java.util.List;

public enum ActionType {
    SLOWMOTION(
            "Slowmotion",
            "<b>Що таке SloMo?</b>\n" +
                    "\n" +
                    "<i>Slow-mo (Rapide)</i> - це прискорена відео-зйомка з частотою кадрів 200-10000 fps. \n" +
                    "\n" +
                    "<b>Як працює послуга SlowMo?</b>\n" +
                    "\n" +
                    "Послуга складається з наступних етапів: \n" +
                    "\n" +
                    "<b>1. Підготовка до події</b>\n" +
                    "Погодження таймінгів, формату роботи, підбір треку тощо.\n" +
                    "<i>Тривалість: від 15 хв.</i>\n" +
                    "<b>2. Монтаж на локації</b>\n" +
                    "Приїзд та мотаж на локації. Погодження технічних деталей.\n" +
                    "<i>Тривалість: від 30 хв.</i>\n" +
                    "<b>3. Відеозйомка slow-mo роликів</b> \n" +
                    "Наш аніматор допоможе гостям з вибором реквізиту та міні-сценками.\n" +
                    "Оператор зафіксує яскраві моменти на камеру;) \n" +
                    "<i>Тривалість: від 3 год.</i>\n" +
                    "<b>4. Монтаж відео</b> \n" +
                    "Паралельно зі зйомкою відбувається монтаж відео ролика. Ваші гості зможуть побачити себе в дії ще до завершення свята.\n" +
                    "<i>Тривалість: від 3 год.</i> \n" +
                    "<b>5. Показ  SlowMo ролика</b> \n" +
                    "Грандіозне завершення процесу зйомки. \n" +
                    "<i>Тривалість: до 5 хв.</i>\n" +
                    "<b>P.S.</b>Показ ролика гостям. Виведення ролика на екран не входить до вартості і забезпечується замовником. \n" +
                    "\n" +
                    "<b>Ціна послуги?</b>\n" +
                    "\n" +
                    "<b>600$</b> під ключ в межах Києва.  \n" +
                    "\n" +
                    "Виїзд за межі Києва прораховується індивідуально. \n" +
                    "\n" +
                    "<b>Що входить у вартість?</b>\n" +
                    "Нічого) Гроші на вітер.\n" +
                    "\n" +
                    "<b>Скільки людей працює на локації?</b>\n" +
                    "\n" +
                    "В команді SlowMo три людини: \n" +
                    "<b>*</b>Оператор slowmo-камери \n" +
                    "<b>*</b>Аніматор-постановник  \n" +
                    "<b>*</b>Монтажер відео \n" +
                    "<b>!?</b>Інколи ще водій;)\n" +
                    "\n" +
                    "<b>Який розмір зони для зйомки SlowMO?</b>\n" +
                    "Ідеальний: <i>4х5 м</i>\n" +
                    "Оптимальний: <i>3х4 м</i>\n" +
                    "Мінімальний: <i>3х2 м</i>",
            Collections.emptyList()),
    PHOTO_PRINTING(
            "Фотодрук",
            "<b>Що таке Фотодрук на події?</b>\n" +
                    "\n" +
                    "<i>Фотодрук на події?</i> - це друк фото на твоєму святі/корпоративі/вечірці під час її проведення. Гарна згадка про шалені емоції відразу на святі.\n" +
                    "\n" +
                    "<b>Як працює послуга Фотодруку?</b>\n" +
                    "\n" +
                    "Послуга складається з наступних етапів:\n" +
                    "\n" +
                    "<b>1. Підготовка до події</b>\n" +
                    "Погодження таймінгів, формату фото, цифрової рамки, тощо.\n" +
                    "<i>Тривалість: від 15 хв.</i>\n" +
                    "<b>P.S.</b> Замовлення менше ніж за 1 робочий день додає +50% до вартості.\n" +
                    "<b>2. Монтаж на локації</b>\n" +
                    "Приїзд та мотаж на локації. Погодження технічних деталей.\n" +
                    "<i>Тривалість: від 15 хв.</i>\n" +
                    "<b>3. Злив та відбір фото</b> \n" +
                    "Оператор копіює фото, відбирає кращі кадри, погоджує їх з замовником. \n" +
                    "<i>Тривалість: від 3 хв/фото.</i>\n" +
                    "<b>4. Обробка фото</b> \n" +
                    "Оператор обробляє відібрані на попередньому етапі фото. Робить їх гарненькими та милими котиками %) \n" +
                    "<i>Тривалість: від 3 хв/фото.</i>\n" +
                    "<b>5. Друк фото</b> \n" +
                    "Оператор додає погоджену цифрову рамку і друкує фото в замовленому розмірі.\n" +
                    "<i>Тривалість: від  20 сек/фото.</i>\n" +
                    "<b>P.S.</b> Поширення фото серед гостей забезпечується замовником. \n" +
                    "\n" +
                    "<b>Ціна послуги?</b>\n" +
                    "\n" +
                    "<b>100$</b> -  виїзд команди на друк в межах м.Київ;\n" +
                    "<b>0.75$</b> - друк з обробкою фото 10х15;\n" +
                    "<b>1.5$</b> - друк з обробкою фото 15х20;\n" +
                    "<b>3.0$</b> - друк з обробкою фото 20х30;\n" +
                    "<b>20$</b> - розробка рамки без ТЗ від замовника з трьома після правками.\n" +
                    "<b>P.S.</b> Виїзд за межі Києва прораховується індивідуально. \n" +
                    "\n" +
                    "<b>Що входить у вартість?</b>\n" +
                    "<b>*</b> 8 годин роботи оператора\n" +
                    "<b>*</b> трансфер до 25 км в одному нарямку від центра м. Київ.\n" +
                    "<b>*</b> розробка цифрової рамки по ТЗ замовника (див. нижче)\n" +
                    "<b>*</b> друк фото з цифровою рамкою\n" +
                    "\n" +
                    "<b>Що таке ТЗ на цифрову рамку?</b>\n" +
                    "Чітко прописане і передане нам завдання в домовлений спосіб, яке містить наступну інформацію:\n" +
                    "<b>1.</b> Екскіз фото з розміщенням усіх елементів\n" +
                    "<b>2.</b> Всі графічні елементи з роздільною здатність 300dpi та вище.\n" +
                    "\n" +
                    "<b>Скільки людей працює на локації?</b>\n" +
                    "В команді Фотодруку одна людина: \n" +
                    "<b>*</b>Оператор MacBook Pro \n" +
                    "<b>!!!</b>Ще фотограф, якщо ви замовили додатково його у нас.\n" +
                    "<b>!?</b>Інколи ще водій;)\n" +
                    "\n" +
                    "<b>Які вимоги до робочої зони Фотодруку?</b>\n" +
                    "Ідеальний: стіл, стілець, розетка, кава, тортик.\n" +
                    "Оптимальний: стіл, стілець, розетка, кава.\n" +
                    "Мінімальний: стіл, стілець, розетка",
            Arrays.asList("https://honeypro.com.ua/wp-content/uploads/2016/11/s_1475-1024x683.jpg",
                    "https://honeypro.com.ua/wp-content/uploads/2016/11/IMG_6448-1024x683.jpg",
                    "https://honeypro.com.ua/wp-content/uploads/2016/11/IMG_6316-1024x683.jpg",
                    "https://honeypro.com.ua/wp-content/uploads/2016/11/IMG_2246-1024x683.jpg")),
    PHOTO_BOOTH("Фотобудка", "Вітання!\n\nТут ти знайдеш інформацію по Фотобудці!                           <a href=\"\">&#8204;</a>", Collections.emptyList()),
    PHOTO_BOOTH_360("Фотобудка360", "Вітання!\n\nТут ти знайдеш інформацію про Фотобудці360!", Collections.emptyList()),
    VINYL_MAGNETS("Вінілові магніти", "Вітання!\n\nТут ти знайдеш інформацію про Вінілові магніти!", Collections.emptyList()),
    CONTACT_US("Контакти", "Зв'язатися з нами:", Collections.emptyList()),
    MENU("Меню", "Вітання! \n" +
            "\n" +
            "Вас вітає Telegram-bot компанії <b>Honeypro</b>. \n" +
            "Тут є відповіді на найпоширеніші питання та швидкий зв’зок з нами \n" +
            "З повагою, Honey-pro team:) \n" +
            "\n" +
            "<b>Web:</b> <a href=\"https://www.honeypro.com.ua\">honeypro.com.ua</a>\n" +
            "<b>Email: </b>info@honeypro.com.ua\n" +
            "<b>Tel:</b> +380635250525\n" +
            "<b>Instagram:</b> <a href=\"https://www.instagram.com/honeyprophoto/\">honeypro.com.ua</a>\n" +
            "<b>Telegram:</b> @honeyprophoto",
            Collections.emptyList());

    @Getter
    private String buttonText;

    @Getter
    private String messageText;

    @Getter
    private List<String> photoUrls;

    ActionType(String buttonText, String messageText, List<String> photoUrls) {
        this.buttonText = buttonText;
        this.messageText = messageText;
        this.photoUrls = photoUrls;
    }
}
